# Case Study - Babies' names in the US from 1880 to 2015

## Learning Objectives:
1. Perform group-wise operations using Pandas
2. Familiar with Pandasâ€™s groupby objects 
3. Practice aggregate, filter and apply functions in Pandas

In [1]:
import numpy as np
import pandas as pd

<i><b>Background</b></i>: The dataset, `babynames.csv`, keeps the record of all the male/female baby names in the US from 1880 to 2015, together with their corresponding count ("n") and proportion ("prop") among all the new borns in that year. We will use this dataset to practice group-wise operations using Pandas.

### Load data

In [3]:
babynames = pd.read_csv("babynames.csv")

In [4]:
babynames.head(10)

   year sex       name     n      prop
0  1880   F       Mary  7065  0.072384
1  1880   F       Anna  2604  0.026679
2  1880   F       Emma  2003  0.020522
3  1880   F  Elizabeth  1939  0.019866
4  1880   F     Minnie  1746  0.017889
5  1880   F   Margaret  1578  0.016167
6  1880   F        Ida  1472  0.015081
7  1880   F      Alice  1414  0.014487
8  1880   F     Bertha  1320  0.013524
9  1880   F      Sarah  1288  0.013196

### Task 1. On Hilary

Let's focus on a particular baby name first. Let's find out the name 'Hilary' appears in our data

In [5]:
fil_hilary = (babynames['name'] == 'Hilary')
hilary = babynames.loc[fil_hilary,:]

In [6]:
hilary.head(10)

       year sex    name  n      prop
5757   1882   M  Hilary  7  0.000057
7952   1883   M  Hilary  6  0.000053
17221  1887   M  Hilary  7  0.000064
27703  1891   M  Hilary  8  0.000073
42705  1896   M  Hilary  6  0.000046
45867  1897   M  Hilary  5  0.000041
49142  1898   M  Hilary  5  0.000038
62078  1902   M  Hilary  8  0.000060
69355  1904   M  Hilary  5  0.000036
72854  1905   M  Hilary  6  0.000042

## Task 1-1. Find out the number of males and number of females with the name 'Hilary' in each year.

#### Hint:- GROUP all the males and all the females, having name 'Hilary' and find out the TOTAL number

In [ ]:
### Write your code here
###

In [7]:
### Solution
hilary.groupby(['year', 'sex'])["n"].sum() #just use sum to show the numbers

year  sex
1882  M      1
1883  M      1
1887  M      1
1891  M      1
1896  M      1
            ..
2011  F      1
2012  F      1
2013  F      1
2014  F      1
2015  F      1
Length: 191, dtype: int64

### Task 2. Group-wise operations

## Task 2-1. Count the number of names by year and sex
#### Find out the TOTAL number of names Grouped By sex for each year

In [ ]:
### Write your code here
###

In [8]:
### Solution
babynames.groupby(['year', 'sex']).size()

year  sex
1880  F        942
      M       1058
1881  F        938
      M        997
1882  F       1028
             ...
2013  M      14026
2014  F      19150
      M      14026
2015  F      18993
      M      13959
Length: 272, dtype: int64

## Task 2-2. Calculate ranking of each name for each year and sex combination. Which names were most popular in 1999? 
#### Hint: ranking can be calculated using argsort() in a lambda function.

In [ ]:
### Write your code here
###

In [9]:
### Solution

babynames['rank'] = babynames.groupby(['year', 'sex'])['prop'].apply(lambda x: (-x).argsort())
 
babynames['rank'] = babynames.groupby(['year', 'sex'])['rank'].apply(lambda x: x.argsort())
 
babynames.head(20)

    year sex       name     n      prop  rank
0   1880   F       Mary  7065  0.072384     0
1   1880   F       Anna  2604  0.026679     1
2   1880   F       Emma  2003  0.020522     2
3   1880   F  Elizabeth  1939  0.019866     3
4   1880   F     Minnie  1746  0.017889     4
5   1880   F   Margaret  1578  0.016167     5
6   1880   F        Ida  1472  0.015081     6
7   1880   F      Alice  1414  0.014487     7
8   1880   F     Bertha  1320  0.013524     8
9   1880   F      Sarah  1288  0.013196     9
10  1880   F      Annie  1258  0.012889    10
11  1880   F      Clara  1226  0.012561    11
12  1880   F       Ella  1156  0.011844    12
13  1880   F   Florence  1063  0.010891    13
14  1880   F       Cora  1045  0.010707    14
15  1880   F     Martha  1040  0.010655    15
16  1880   F      Laura  1012  0.010368    16
17  1880   F     Nellie   995  0.010194    17
18  1880   F      Grace   982  0.010061    18
19  1880   F     Carrie   949  0.009723    19

In [10]:
babynames.groupby(['year', 'sex']).get_group((1999, 'F'))

         year sex      name      n      prop   rank
1304060  1999   F     Emily  26537  0.013638      0
1304061  1999   F    Hannah  21669  0.011136      1
1304062  1999   F    Alexis  19232  0.009884      2
1304063  1999   F     Sarah  19088  0.009810      3
1304064  1999   F  Samantha  19034  0.009782      4
...       ...  ..       ...    ...       ...    ...
1320993  1999   F     Zohal      5  0.000003  15248
1320994  1999   F    Zophia      5  0.000003  15249
1320995  1999   F      Zuha      5  0.000003  15250
1320996  1999   F     Zuhal      5  0.000003  15243
1320997  1999   F      Zuzu      5  0.000003  16937

[16938 rows x 6 columns]

In [11]:
babynames[(babynames['year'] == 1999) & (babynames['rank'] == 0)]

         year sex   name      n      prop  rank
1304060  1999   F  Emily  26537  0.013638     0
1320998  1999   M  Jacob  35346  0.017344     0

## Task 2-3. What are the Top 10 in overall name popularity (in terms of total "n") by "sex"?
#### aggregating on column 'n', and sorting values in Descending order should get you the top 10

In [ ]:
### Write your code here
###

In [ ]:
### Solution

babynames.groupby(['name', 'sex'])[['n']].agg(np.sum)

In [ ]:
babynames.groupby(['name', 'sex'])[['n']].agg(np.sum).sort_values(by='n', ascending=False).head(10)

## Task 2-4. What is the proportion of babies having the top 100 names for each year and sex?

In [ ]:
### Write your code here
###

In [ ]:
### Solution

top100 = babynames[babynames['rank'] < 100]
top100.head()

In [ ]:
top100prop = top100.groupby(['year', 'sex'])[['prop']].agg(np.sum).reset_index()
top100prop.head(10)

## Task 2-5. For each name, find the year in which it was ranked highest and it's rank in that year.
#### The column 'most_pop' could be created by Grouping name and sex, with rank and transforming with lambda function.
#### You can test for a specific group using - get_group(("Mary", "F"))

In [ ]:
babynames['most_pop'] = babynames.groupby(['name', 'sex'])['rank'].transform(lambda x: (x == np.min(x)))

In [ ]:
# You can look at a specific group using Female & "Mary"
babynames_gb = babynames.groupby(['name', 'sex'])
babynames_gb.get_group(("Mary", "F"))

In [ ]:
# You can look at a specific group using Female & "Anna" using filtering
fil = (babynames["name"] == "Anna") & (babynames["sex"] == "F")
babynames.loc[fil,:]

In [ ]:
babynames[babynames['most_pop'] == True].groupby(['name', 'sex']).head(1)

## Task 2-6. Which name has been in the top 10 most often?

In [ ]:
top10 = babynames[babynames['rank'] < 10]
top10.head()

In [ ]:
top10_count = top10.groupby(['name', 'sex']).size().reset_index()
top10_count.columns = ['name', 'sex', 'top10_count']
top10_count.sort_values(by = 'top10_count', ascending = False).head(30)